In [1]:
%matplotlib inline
import pandas as pd

In [2]:
import numpy as np

In [3]:
titles = pd.read_csv('titles.csv')
cast = pd.read_csv('cast.csv')
release = pd.read_csv('release_dates.csv')

titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
release.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [5]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [6]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [7]:
release.columns

Index(['title', 'year', 'country', 'date'], dtype='object')

In [8]:
titles.isnull().sum()

title    0
year     0
dtype: int64

### How many movies are listed in the titles dataframe?

In [9]:
titles['title'].value_counts().sum()

244914


### What are the earliest two films listed in the titles dataframe?

In [11]:
# titles.sort_values(by=['year']).head(2)

earliest_two = titles.sort_values(by=['year'])
earliest_two.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [12]:
a = titles[titles['title'] == "Hamlet"]
a

         title  year
6422    Hamlet  2017
10637   Hamlet  1921
39916   Hamlet  1913
52521   Hamlet  1910
62000   Hamlet  2000
67406   Hamlet  1969
82130   Hamlet  1987
88065   Hamlet  2016
101728  Hamlet  1948
122827  Hamlet  1973
133921  Hamlet  1976
154029  Hamlet  2015
161324  Hamlet  1964
172640  Hamlet  1954
173033  Hamlet  2011
178222  Hamlet  1996
189093  Hamlet  2009
192142  Hamlet  1990
198234  Hamlet  1911
202025  Hamlet  2014

In [13]:
totalNoOfHamlet = a['title'].value_counts().sum()
print("Total no of Hamlet movies are ",totalNoOfHamlet)

Total no of Hamlet movies are  20

### How many movies are titled "North by Northwest"?

In [14]:
b= titles[titles['title'] == "North by Northwest"]
b

                    title  year
74398  North by Northwest  1959

In [15]:
totalNoNorthByNorthwest = b['title'].value_counts().sum()
print("Total no of Hamlet movies are ",totalNoNorthByNorthwest)

Total no of Hamlet movies are  1

### When was the first movie titled "Hamlet" made?

In [16]:
# a['year'].sort_values().head(1)
totalHamletMovies = titles[titles['title'] == 'Hamlet']
firstHamletMovie = totalHamletMovies.sort_values(by=['year'])
firstMovieYear = firstHamletMovie['year'].head(1)
print("First movie of Hamlet was made in",firstMovieYear)

First movie of Hamlet was made in 52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [17]:
treasureIslandAllMovies = titles[titles['title'] == "Treasure Island"].sort_values(by=['year'])

In [18]:
treasureIslandAllMovies

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [19]:
year_1950 = titles[titles['year'] == 1950 ]

moviesMadeIn1950 = year_1950['year'].value_counts().sum()

In [20]:
# titles[titles['year'] == 1950]
print("No of movies made in 1950 was ",moviesMadeIn1950)

No of movies made in 1950 was  1113

### How many movies were made in the year 1960?

In [21]:
aa = titles[titles['year'] == 1960 ]
aa['year'].value_counts().sum()

1549

### How many movies were made from 1950 through 1959?

In [22]:
moviesAfter1950 = titles[titles['year'] >= 1950]
moviesAfter1950.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

In [23]:
moviesBefore1959 = moviesAfter1950[moviesAfter1950['year'] <= 1959]
moviesBefore1959.head(2)

             title  year
5       Tight Spot  1955
8  Bao dao mei ren  1956

In [24]:
moviesBefore1959['year'].value_counts().sum()

12934

### In what years has a movie titled "Batman" been released?

In [25]:
movieBatman = titles[titles['title'] == "Batman"]
movieBatman

         title  year
39349   Batman  1943
240896  Batman  1989

In [26]:
year_Batman = movieBatman['year']
year_Batman

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [27]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [28]:
inceptionMovies = cast[cast['title'] == 'Inception']
inceptionMovies.head()

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

In [29]:
allInceptionCharater = inceptionMovies['character'].unique()
totalCharacter = len(allInceptionCharater)
print("In Inception movie total no of Roles was",totalCharacter)

In Inception movie total no of Roles was 56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [32]:
inceptionMovies.head(1)

           title  year                  name   type      character   n
98153  Inception  2010  Michael (III) August  actor  LAX Passenger NaN

In [38]:
inceptionMovies['n'].isnull().sum()

27

In [37]:
inceptionMovies['n'].isnull().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [39]:
nValue = inceptionMovies[inceptionMovies['n'] >= 0]

In [41]:
nValue['n'].count()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [43]:
castOfNorthwest = cast[cast['title'] == 'North by Northwest']

In [45]:
newcastOfNorthwest = castOfNorthwest[castOfNorthwest['n'] >= 0]

In [66]:
assending_cast = newcastOfNorthwest.sort_values(by=['n'])

assending_cast.head()

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [72]:
sleuthCast = cast[cast['title'] == 'Sleuth']
sleuthCast.head()

         title  year                 name   type          character    n
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
326773  Sleuth  1972        Michael Caine  actor        Milo Tindle  2.0
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
373876  Sleuth  1972       Alec Cawthorne  actor  Inspector Doppler  3.0
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

In [75]:
year1972Cast = sleuthCast[sleuthCast['year'] == 1972]
year1972Cast.head()

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0

In [79]:
listOfChar = year1972Cast['character']
listOfChar

for i in listOfChar:
    print(i)

Milo Tindle
Inspector Doppler
Police Constable Higgs
Detective Sergeant Tarrant
Andrew Wyke
Marguerite Wyke

In [85]:
year1972Cast = year1972Cast[year1972Cast['n'] >= 0]

In [86]:
year1972Cast.sort_values(by=['n']).head()

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [90]:
sleuthCast.head()

         title  year                 name   type          character    n
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
326773  Sleuth  1972        Michael Caine  actor        Milo Tindle  2.0
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
373876  Sleuth  1972       Alec Cawthorne  actor  Inspector Doppler  3.0
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

In [91]:
year2007 = sleuthCast[sleuthCast['year'] == 2007]
year2007

          title  year                 name     type          character    n
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [92]:
year2007 = year2007[year2007['n'] >= 0]

In [93]:
year2007.sort_values(by=['n']).head()

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [100]:
year1921Hamlet = cast[cast['title'] == 'Hamlet']
year1921Hamlet = year1921Hamlet[year1921Hamlet['year'] == 1921]
year1921Hamlet

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [103]:
print("Total roles",year1921Hamlet['character'].count())

Total roles 9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [112]:
year1921Hamlet = cast[cast['title'] == 'Hamlet']
year1996Hamlet = year1921Hamlet[year1921Hamlet['year'] == 1996]
year1996Hamlet.head(10)

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
250773,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
260225,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
272749,Hamlet,1996,Richard Briers,actor,Polonius,6.0
294652,Hamlet,1996,Michael Bryant,actor,Priest,7.0
319501,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0

In [114]:
noOfRoles = year1996Hamlet[year1996Hamlet['name'] == 'Kenneth Branagh']

In [115]:
noOfRoles['n']

260225    5.0
Name: n, dtype: float64

### How many "Hamlet" roles have been listed in all film credits through history?

In [119]:
creditThroughHistore = cast[cast['title'] == 'Hamlet']

In [122]:
creditThroughHistore.head(100)

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
7789,Hamlet,1921,Fritz Achterberg,actor,"Fortinbras,",9.0
11728,Hamlet,2009,Hayden Adams,actor,Laertes,7.0
11729,Hamlet,2009,Hayden Adams,actor,Player,7.0
14493,Hamlet,1913,Eric Adeney,actor,Reynaldo,14.0
...,...,...,...,...,...,...
868259,Hamlet,1969,Clive Graham,actor,Guildenstern,9.0
869319,Hamlet,2000,Paul (IV) Graham,actor,Special Guest Appearance,27.0
882612,Hamlet,2015,Dean Gregory,actor,Lucianus,14.0
885936,Hamlet,2000,Henry (II) Griffin,actor,Special Guest Appearance,28.0
886568,Hamlet,1969,David (IV) Griffith,actor,Messenger,17.0

In [121]:
creditThroughHistore[creditThroughHistore['name'] == 'credits through history']

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?